[
  {
    "title": "Civil Law",
    "img_src": "/images/services/criminal_law.jpg",
    "description": [
      "Our civil law practice covers a broad range of legal disputes involving private rights and obligations under the Civil Procedure Code, 1908. We represent clients in matters including but not limited to property disputes, contractual breaches, recovery of dues, declarations, injunctions, and tort claims. Our approach focuses on strategic litigation and dispute resolution through both trial and appellate courts."
    ]
  },
  {
    "title": "Criminal Law",
    "img_src": "/images/services/criminal_law.jpg",
    "description": [
      "We provide robust legal defense and prosecution support under the Pakistan Penal Code, 1860, Criminal Procedure Code, 1898, and relevant special laws. Our criminal law practice includes bail applications, trial representation, white-collar crime, anti-corruption proceedings, cybercrime cases under the PECA Act, 2016, and criminal appeals. We are committed to safeguarding our clients’ rights through every stage of the legal process."
    ]
  },
  {
    "title": "Family Law",
    "img_src": "/images/services/criminal_law.jpg",
    "description": [
      "Our family law practice is deeply rooted in cultural sensitivity and legal precision. We advise and represent clients in all matters governed under Muslim Family Laws Ordinance, 1961, West Pakistan Family Courts Act, 1964, and other relevant statutes. Our services include divorce (talaq and khula), maintenance, guardianship, child custody, dower claims, and inheritance matters under Islamic and civil law frameworks."
    ]
  },
  {
    "title": "Corporate & Commercial Law",
    "img_src": "/images/services/criminal_law.jpg",
    "description": [
      "We provide legal counsel on a wide array of corporate matters including business structuring, compliance, governance, and transactions. Our team is well-versed in the Companies Act, 2017, Partnership Act, 1932, and Contract Act, 1872. We assist in company incorporation, shareholder agreements, M&A, commercial contracts, and regulatory compliance with SECP and other authorities."
    ]
  },
  {
    "title": "Cooperative & Property Law",
    "img_src": "/images/services/criminal_law.jpg",
    "description": [
      "Our cooperative and real estate law services are designed to assist clients in navigating complex land and housing matters. We handle legal issues related to cooperative housing societies, lease and sale agreements, land acquisition, title verification, and litigation under laws such as the Cooperative Societies Act, 1925 and Transfer of Property Act, 1882. Whether dealing with development authorities or private disputes, we ensure clear and enforceable legal outcomes."
    ]
  },
  {
    "title": "Intellectual Property & Trademark Law",
    "img_src": "/images/services/criminal_law.jpg",
    "description": [
      "We assist individuals and businesses in protecting their intellectual assets through trademark registration, enforcement, and litigation under the Trademarks Ordinance, 2001 and Intellectual Property Organization (IPO) Pakistan regulations. Our services include filing applications, responding to objections, managing oppositions, and taking legal action against infringement. We also advise on copyrights, patents, and design rights."
    ]
  }
]
